app/controllers/visitors_controller.rb

  def index
    @visitors = Visitor.all
---
SELECT `visitors`.* FROM `visitors`

  def create
    @visitor = Visitor.new(visitor_params)

    respond_to do |format|
      if @visitor.save
---
INSERT INTO `visitors` (`event_time`, `created_at`, `updated_at`) VALUES (1470897700.0, '2016-08-11 13:52:16', '2016-08-11 13:52:16')

  def destroy
    @visitor.destroy
---
DELETE FROM `visitors` WHERE `visitors`.`id` = 8

  def import
    #TODO: Remove the hardcoded file name
    file_path = Rails.public_path.join('visitors.csv')
---
SELECT `visitors`.* FROM `visitors`

  def set_visitor
    @visitor = Visitor.find(params[:id])
---
SELECT  `visitors`.* FROM `visitors` WHERE `visitors`.`id` = 31 LIMIT 1